The  ViewDisplayDepthCueing  type exposes the following members.
 Properties
Name  |   Description
EnableDepthCueing
 True to enable depth cueing. False to disable it.
EndPercentage
 The end percentage defines where depth cueing ends. Values between 0 and 100.
FadeTo
 The fade to defines the maximum fading in per cent. Values between 0 and 100.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
StartPercentage
 The start percentage defines where depth cueing starts. Values between 0 and 100.
 See Also
  ViewDisplayDepthCueing Class
  Autodesk.Revit.DB Namespace